ci4projcet3/app/Controllers/Student.php

    public function index()
    {

        $modeldata = new StudenModel();
        $data['students'] = $modeldata->findAll();
---
SELECT *
FROM `students`